package Matrix;

public class arcans {
    public arcans(int i) { //карты таро
        switch (i) {
            case 1 -> System.out.println("""
                    1 код судьбы - это энергия мага, чудотворца. Носители энергии 1 Аркана - люди с уникальными способностями, неординарные, яркие личности, которые могут вдохновлять других.
                     В плюсе они могут влиять на других людей.
                     В минусе могут влиять на мир в корыстных целях (черная магия), эгоистичная личность.""");
            case 2 -> System.out.println("""
                    2 код судьбы - Верховная жрица.
                    В плюсе - это энергия целостности, объединяет, регулирует, обтекает. Она имеет расслабляющее влияние.
                    В минусе - вносит дисгармонию, будет наоборот разделять. В этом случае человек часто является пассивным, ничего не делает.""");
            case 3 -> System.out.println("""
                    3 код судьбы - энергия Императрицы.
                    В плюсе - это земная женская энергия, энергия плодородия, царственная особа. Эта женщина всегда блестит, умеет себя подать. Часто эти люди руководят. Она, как мать, у нее все в порядке, все под контролем.
                    В минусе - это властная, деспотичная, все контролирующая, всех заставляет жить по своим правилам, капризная.
                    У мужчин может появляться в том, что он работает в женском коллективе.
                    В плюсе - у них всегда дочь, мать.
                    В минусе - становятся зависимыми от женщин, могут поменять сексуальную ориентацию, быть слабыми, убегают от ответственности.""");
            case 4 -> System.out.println("""
                    4 код судьбы - Мужская энергия.
                    В плюсе - Число власти, хорошие управленцы, хозяйские, лидеры, политики, хорошо проявляют себя в бизнесе, финансах, умеют считать деньги.
                    В минусе - Деспотические, властные, жесткие, самодуры, контроль, любят подчинять, может не быть денег.
                    Женщины с этой энергией хорошо чувствуют себя в мужском коллективе, часто стремятся доминировать.""");
            case 5 -> System.out.println("""
                    5 код судьбы - Число духовного учителя.
                    В плюсе - прирожденные ораторы, учителя, законники, руководители. Как правило это правильные, ответственные, надежные люди. Для них важны традиции семьи, они часто являются религиозными.
                    В минусе - сектанство, непринятие, навязывание.""");
            case 6 -> System.out.println("""
                    6 код судьбы - Аркан любви. Взаимоотношения мужчин и женщин, люди коммуникаций, всех объединяют, имеют много контактов, взаимоотношений.
                    В плюсе - принятие людей, безусловная любовь, создают красоту, эстеты, гурманы.
                    В минусе - зациклены на отношениях, на семье, избыточная любовь, разрушающая чувства. Идеализация, комплекс отличника.""");
            case 7 -> System.out.println("7 код судьбы - Энергия победителя, воина. Он воинственный. Мощная " +
                    "целеустремленность, лидер, ведет за собой.\nВ минусе - Может идти по головам, делить " +
                    "мир на добро и зло.");
            case 8 -> System.out.println("""
                    8 код судьбы - Карта правосудия или справедливости.
                    В плюсе - Эти люди постигли кармические законы, причинно-следственные связи. Люди, способные работать с кармой других людей, переделывать свою карму и карму предков и пытаются уравновесить процессы. Такие люди часто работают юристами, судьями.
                    В минусе - Придираются, пытаются со всеми разобраться, делят мир на добро и зло.""");
            case 9 ->
                    System.out.println("9 код судьбы - Аркан отшельника и мудреца. Они носители житейской мудрости. Освещают" +
                            " путь, исцеляют души и тела. Работают врачами, травниками, психологами. Умные, мудрые " +
                            "люди, связанные с писательством. Зарабатывают деньги своей головой.\nВ минусе - " +
                            "Отшельники, закрытые, оскорбительные, глубоко одинокие, самодостаточные.");
            case 10 ->
                    System.out.println("10 код судьбы - Люди потока. Они счастливчики по судьбе и их несет. Они могут " +
                            "просто расслабиться. Этим людям нужно развивать интуицию, чтобы не прыгать не в свои" +
                            " потоки.\nВ минусе - они пассивны, не хотят духовно развиваться.");
            case 11 ->
                    System.out.println("11 код судьбы - Аркан силы. Эти люди одаренные потенциалом, они трудоголики, у них" +
                            " много энергии, постоянно работают, постоянно чем-то заняты. Это страстные, горячие" +
                            " люди, хорошие специалисты.\nВ минусе - разрушают окружающий мир, остаются без сил.");
            case 12 -> System.out.println("""
                    12 код судьбы - Аркан повешенные. Это люди энергии нового видения, миротворчества, миссионерства. У них
                     всегда иное видение, они другие. Они могут сгенерировать кучу новых идей, новые знания, нестандартно\040
                     мыслящие. Они очень добрые, отзываются на нужды других, эмпатическое.
                    В минусе - приносят себя жертву, все отдают. Часто зависают.
                    Им важно любить себя, не бояться перемен, отказываться от старого.""");
            case 13 -> System.out.println("""
                    13 код судьбы - Аркан смерти. Среди людей этой энергии много строителей, хирургов, им нужен риск, адреналин. Им нужно находить экстремальные формы развлечений.
                    В плюсе - креативные, подвижные, мощные, у них все меняется, смена картинок, им нужно развитие.
                    В минусе - резкость, невозможность застабилизироваться, делают больно, безбашенные.""");
            case 14 ->
                    System.out.println("14 код судьбы - Развитая, зрелая душа. Ангельский канал, портал общения с ангелами." +
                            " Пробуждают души других людей, испытывающих эмоции других людей. Изящные люди, люди " +
                            "искусства (много артистов, художников), хорошие психологи, работающие с душами других" +
                            " людей. Им стоит больше контактировать с водой.\nВ минусе - не выдержаны, незрелые " +
                            "души, заземлены.");
            case 15 ->
                    System.out.println("15 код судьбы - Аркан искушения, дьявола. Такие люди есть проверяющими, провоцируют" +
                            " негатив, они Лакмусовые бумажки на негатив других людей. Они обнажают проблемы людей" +
                            ", являются провокаторами. Чистильщики. Их либо любят, либо ненавидят. Они могут " +
                            "работать с зависимыми, со слабостями людей. У них есть мощная сила, могут обладать " +
                            "даром ясновидения.\nВ минусе - манипуляторы, зависящие от вредных привычек: алкоголя," +
                            " наркотиков и т.д..");
            case 16 ->
                    System.out.println("16 код судьбы - Аркан Башни. Энергия трансформации всего старого, сильная энергия." +
                            " Они обладают способностью духовно пробуждать других людей, приводить к Богу. Могут " +
                            "заниматься экстремальными видами спорта.\nВ минусе - агрессия, разрушение.");
            case 17 ->
                    System.out.println("17 код судьбы - Аркан Звезды. Отдача через творчество, работу, миссионерство. " +
                            "Пропускают через себя энергию потока и отдают людям. Это звездные люди, они блестят." +
                            "\nВ минусе они серенькие, незаметные, ни рыба, ни мясо.");
            case 18 ->
                    System.out.println("18 код судьбы - энергия Луны, магии, ритуалов, непознанного, энергия ночи. Хорошо" +
                            " пишут, рисуют, прекрасно перевоплощаются, актеры. Им часто присуще ясновидения, " +
                            "яснознання, осознанные совидиння. Очень мощно материализуют мысли, мистики. Это - " +
                            "женская энергия. Эти люди часто являются совами.\nВ минусе - уходят в нереальные " +
                            "миры. Попадают в мир страхов.");
            case 19 ->
                    System.out.println("19 код судьбы - энергия Солнца, успеха, свечения, передачи энергии, знаний другим" +
                            ". Такие люди очень заметны. Нередко могут быть общественными, политическими деятелями" +
                            ".\nВ минусе - агрессивно-выжигающая энергия.");
            case 20 ->
                    System.out.println("20 код судьбы - Аркан рода и предков. Аркан яснознання. Такие люди получают " +
                            "информацию о судьбах людей, могут быть кармическими целителями. Такие люди являются " +
                            "как бы порталом между миром живых и мертвых.\nВ минусе - осуждение, обсуждение других" +
                            ". Заземление.");
            case 21 ->
                    System.out.println("21 код судьбы. Эти люди являются миротворцами, им хочется принести благо большему " +
                            "количеству людей, хочется нести мир, они являются глобалистами. Часто они работают в " +
                            "иностранных компаниях, много путешествуют по миру.\nВ минусе - настроены против всего" +
                            " мира, против большого количества людей. Все для них не так.");
            case 22 ->
                    System.out.println("22 код судьбы. Этот Аркан является переходным от семерицы духа в мир материи. Это" +
                            " люди-вагончики, в них много энергии свободы. Они помогают другим людям перейти на" +
                            " другой уровень. Свободолюбивые, ни за что не зацепленные, дают другим волшебный " +
                            "пендель, помогают оторваться от обыденности. Очень авантюрные, веселые, жизнерадостные" +
                            ", доверяют Небу. Духовно пробуждают других людей.\nВ минусе - закрытые, зациклены, " +
                            "лишенные свободы, загоняют себя в рамки.");
        }
    }
}
